In [9]:
import pandas as pd

In [3]:
df = pd.read_excel('~/Desktop/bank.xlsx')

In [4]:
df.head()

,Account No,DATE,TRANSACTION DETAILS,CHQ.NO.,VALUE DATE,WITHDRAWAL AMT,DEPOSIT AMT,BALANCE AMT,.
0,409000611074',2017-06-29,TRF FROM Indiaforensic SERVICES,NaN,2017-06-29,NaN,1000000.0,1000000.0,.
1,409000611074',2017-07-05,TRF FROM Indiaforensic SERVICES,NaN,2017-07-05,NaN,1000000.0,2000000.0,.
2,409000611074',2017-07-18,FDRL/INTERNAL FUND TRANSFE,NaN,2017-07-18,NaN,500000.0,2500000.0,.
3,409000611074',2017-08-01,TRF FRM Indiaforensic SERVICES,NaN,2017-08-01,NaN,3000000.0,5500000.0,.
4,409000611074',2017-08-16,FDRL/INTERNAL FUND TRANSFE,NaN,2017-08-16,NaN,500000.0,6000000.0,.

In [7]:
 lamp = df['VALUE DATE'].value_counts()
lamp

2017-07-27    567
2018-08-13    463
2017-11-08    402
2017-10-07    382
2018-07-10    374
             ...
2017-07-22      1
2016-04-14      1
2016-04-23      1
2016-08-07      1
2018-01-07      1
Name: VALUE DATE, Length: 1294, dtype: int64

In [8]:
df.shape

(116201, 9)

In [9]:
df.tail()

,Account No,DATE,TRANSACTION DETAILS,CHQ.NO.,VALUE DATE,WITHDRAWAL AMT,DEPOSIT AMT,BALANCE AMT,.
116196,409000362497',2019-03-05,TRF TO 1196428 Indiaforensic SE,NaN,2019-03-05,117934.30,NaN,-1.901902e+09,.
116197,409000362497',2019-03-05,FDRL/INTERNAL FUND TRANSFE,NaN,2019-03-05,NaN,300000.0,-1.901602e+09,.
116198,409000362497',2019-03-05,FDRL/INTERNAL FUND TRANSFE,NaN,2019-03-05,NaN,300000.0,-1.901302e+09,.
116199,409000362497',2019-03-05,IMPS 05-03-20194C,NaN,2019-03-05,109868.65,NaN,-1.901412e+09,.
116200,409000362497',2019-03-05,Sweep Trf To: 40900036427,NaN,2019-03-05,5000.00,NaN,-1.901417e+09,.

In [13]:
df_x = pd.DataFrame([[1,2],[3,4]],columns = list('AB'),index = list('XY'))

In [14]:
df_x

   A  B
X  1  2
Y  3  4

In [15]:
df_y = pd.DataFrame([[5,6],[7,8]],columns = list('AB'),index = list('XY'))

In [16]:
df_y

   A  B
X  5  6
Y  7  8

In [24]:
df_z = pd.concat([df_x,df_y],ignore_index = True)

In [25]:
df_z

   A  B
0  1  2
1  3  4
2  5  6
3  7  8

In [27]:
df_z.mean()

A    4.0
B    5.0
dtype: float64

In [31]:
df_z.groupby('B')["A"].mean()

B
2    1.0
4    3.0
6    5.0
8    7.0
Name: A, dtype: float64